using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SeminarsCsharp.Seminars
{
    public static class S2p1Theory
    {
        public static void Launch()
        {
            // Seminar 2

            //Theory

            /* Console.WriteLine("Какой--то текст, просто посмотреть команду WriteLine");
               переменные -- ячейки с информацией для хранения данных. Именнованные "коробочки для хранения информации. Цифры, логические, текст и тд.
                КАКИЕ БЫВАЮТ ПЕРЕМЕННЫЕ. 
                INT - целое число. любое. Можно написать сразу со значением. а можно оставить просто "место" под нее `int varA;`
                double - дробное число
                string строка
                bool логический - правда или ложь

            после функции(метода) не ставим ;
            */

            /*Деления:
            Целочисленное -- т е без остатка. int
            Остаток от деления - % int
            деление с дробями. double
            */

            /*Целочислеенные деления:
                13259 / 10 = 1325 
                13259 / 100 = 132
                13259 / 1000 = 13
                13259 / 10000 = 1
            */

            /* остаток от деления
             13254 % 10 = 4
            13254 % 100 = 54
            13254 % 1000 = 254
            13254 % 10000 = 3254
            */

            /*24365 -> 43
                24365 / 100 = 243
                243 % 100 = 43
                24365 // 100 % 100 = 43
            */

            /* Метод - это вызываемая подпрограмма.
             Именнованная и законченная часть кода
             Метод надо описыват вначале, до основного кода.
             */
        }
    }
}
